report/statistics.json
{
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 1515,
    "errorCount" : 1021,
    "errorPct" : 67.39274,
    "meanResTime" : 4393.114851485151,
    "medianResTime" : 2513.0,
    "minResTime" : 59.0,
    "maxResTime" : 13253.0,
    "pct1ResTime" : 10780.2,
    "pct2ResTime" : 11961.200000000003,
    "pct3ResTime" : 12868.72,
    "throughput" : 50.538746372218704,
    "receivedKBytesPerSec" : 80.09809473721519,
    "sentKBytesPerSec" : 4.074901434850052
  },
  "Request" : {
    "transaction" : "Request",
    "sampleCount" : 1515,
    "errorCount" : 1021,
    "errorPct" : 67.39274,
    "meanResTime" : 4393.114851485151,
    "medianResTime" : 2513.0,
    "minResTime" : 59.0,
    "maxResTime" : 13253.0,
    "pct1ResTime" : 10780.2,
    "pct2ResTime" : 11961.200000000003,
    "pct3ResTime" : 12868.72,
    "throughput" : 50.538746372218704,
    "receivedKBytesPerSec" : 80.09809473721519,
    "sentKBytesPerSec" : 4.074901434850052
  }
}